---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.AnalyticalLink
source: html/41048800-9c16-c665-6646-a3834ad9165c.htm
---
# AnalyticalLink Properties

The id of the assembly instance to which the element belongs.